# :heavy_check_mark:Terragrunt Plan
```hcl
Group 1
- Module /home/runner/work/cicd-template-1/cicd-template-1/terraform/sample/hcl/network
Group 2
- Module /home/runner/work/cicd-template-1/cicd-template-1/terraform/sample/hcl/ec2

Plan: 2 to add, 0 to change, 0 to destroy.
```
<details>
<summary>Details</summary>


```hcl
Group 1
- Module /home/runner/work/cicd-template-1/cicd-template-1/terraform/sample/hcl/network
Group 2
- Module /home/runner/work/cicd-template-1/cicd-template-1/terraform/sample/hcl/ec2

--------
COMMAND: terragrunt run-all plan --terragrunt-non-interactive -no-color terragrunt-working-dir=hcl   --terragrunt-source-update 
WORKSPACE: tc3-cicd
AWS_PROFILE: default
--------
[INFO] Getting version from tgenv-version-name
[INFO] TGENV_VERSION is 0.44.5
aws_vpc.this[0]: Refreshing state... [id=vpc-052058af405bc37ec]
aws_subnet.public[2]: Refreshing state... [id=subnet-0a8c47ca2ae69358a]
aws_subnet.public[1]: Refreshing state... [id=subnet-0dbf08dd1a4d25c66]
aws_subnet.public[0]: Refreshing state... [id=subnet-0b11bc131a71ba424]
aws_route_table.public[0]: Refreshing state... [id=rtb-02dd14b5417006bd1]
aws_internet_gateway.this[0]: Refreshing state... [id=igw-0d0d825d8589fc614]
aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-02dd14b5417006bd11080289494]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-019268749a1f382f8]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0290c9b8d7669d3af]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0e7fde4ffd19b6eed]

No changes. Your infrastructure matches the configuration.

Terraform has compared your real infrastructure against your configuration
and found no differences, so no changes are needed.
tls_private_key.default: Refreshing state... [id=7217e49b42b22b0498cb87d29476ae9f98fc4b00]
local_file.public_key_openssh: Refreshing state... [id=91a73712c432b53486f2fb62fbd63024e08a9af8]
local_file.private_key_pem: Refreshing state... [id=6f1b493de5ae4b4be4742cd761bbba6cea491d43]
aws_key_pair.auth: Refreshing state... [id=tc3-cicd-bastion]
aws_security_group.bastion: Refreshing state... [id=sg-0bb8906c7c25f8ed1]
aws_instance.bastion: Refreshing state... [id=i-0da7375e66a81e6ff]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # local_file.private_key_pem will be created
  + resource "local_file" "private_key_pem" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./.key_pair/tc3-cicd-bastion.id_rsa"
      + id                   = (known after apply)
    }

  # local_file.public_key_openssh will be created
  + resource "local_file" "public_key_openssh" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "./.key_pair/tc3-cicd-bastion.id_rsa.pub"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```
</details>
<!-- plan -->